#เครื่องคำนวณค่าไฟฟ้าแบบขั้นบันได
#เขียนโปรแกรมคำนวณค่าไฟฟ้าจากจำนวนหน่วยไฟฟ้าที่ใช้ในเดือนนั้น โดยฟังก์ชัน
#calculate_eletricity_cost(units)

#ค่าไฟฟ้าขึ้นกับปริมาณการใช้งาน
#จำนวนหน่วยที่ใช้    อัตราต่อหน่วย
#1-50 หน่วยแรก   2.50 บาท
#51-100 หน่วย    3.00 บาท
#101-200 หน่วย   3.50 บาท
#มากกว่า 200 หน่วย 4.00 บาท

def calculate_eletricity_cost(units)

units = 150
if units > 200:
    cost = (2.50 * 50)  + (3.00 * 50) + (100 * 3.50) + ((units - 00) * 4.00) + 25
    print("1-50 หน่วย: 125.00 บาท")
    print("51-100 หน่วย: 150.00 บาท")
    print("101-200 หน่วย: 3.00 บาท")
    print("201-{units} หน่วย: {(units - 200) * 4.00} บาท")
    print("ค่าบริการ: 25.00 บาท")
    print("รวมค่าไฟทั้งสิ้น:",cost)
    

elif units > 100:
    cost = (2.50 * 50) + (3.00 * 50) + ((units - 100) * 3.50) + 25
    print("1-50 หน่วย: 125.00 บาท")
    print("51-100 หน่วย: 150.00 บาท")
    print("101-{units} หน่วย: {(units - 100) * 3.50} บาท")
    print("ค่าบริการ: 25.00 บาท")
    print("รวมค่าไฟทั้งสิ้น:",cost)
    

elif units > 50:
    cost = (2.50 * 50) + ((units - 50) * 3.00) + 25
    print("1-50 หน่วย: 125.00 บาท")
    print(f"51-{units} หน่วย: {(units - 50) * 3.00} บาท")
    print("ค่าบริการ: 25.00 บาท")
    print("รวมค่าไฟทั้งสิ้น:",cost)

elif units > 0:
    cost = (2.50 * units) + 25
    print(f"1-{units} หน่วย: {2.50 * units} บาท")
    print("ค่าบรหาร: 25.00 บาท")
    print("ร่วมค่าไฟทั้งสิ้น:", cost)

else:
    print("จำนวนหน่วยไฟฟ้าไม่ติดลบ")

units=int(input("กรอกจำนวนไฟฟ้า:"))
calculate_eletricity_cost(units)

print("===โปรแกรมคำนวณค่าไฟฟ้า===")
while(ture):
    print("1. คำนวณค่าไฟ")
    print("2. ออกโปรแกรม")
    calculate_eletricity_cost(units)
elif choice == "2":
    break
else:
    print("แจ้งเลือเมนูไม่ถูกต้อง")


